app/controllers/api/comments_controller.rb

  def index
    @comments = Comment.all
---
SELECT "comments".* FROM "comments"

  def create
    @comment = Comment.new(comment_params)
    if @comment.save
---
INSERT INTO "comments" ("body", "user_id", "commentable_id", "commentable_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["body", "postman comment"], ["user_id", 13], ["commentable_id", 1], ["commentable_type", "User"], ["created_at", "2020-09-25 13:48:43.681947"], ["updated_at", "2020-09-25 13:48:43.681947"]]