app/controllers/api/items_controller.rb

  def index
    @item = Item.where(["name LIKE ?", "%#{params[:search]}%"])
---
SELECT "items".* FROM "items" WHERE (name LIKE '%%')

  def remove_item_from_cart
    @user = User.find(params[:user_id])
    @cart = @user.cart
    @position = @cart.positions.where("item_id = #{@item.id}").first
    @position.destroy
  end

  private def item_params
    params.require(:item).permit(:name,:weight,:price,:description,:user_id)
  end

  private def position_params
    params.require(:position).permit(:quantity)
  end

  private def find_item
    @item = Item.find(params[:id])
---
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]