app/controllers/api/likes_controller.rb

  def index
     @like = Like.all
---
SELECT "likes".* FROM "likes" ORDER BY "likes"."id" ASC LIMIT $1  [["LIMIT", 1]]

  def create
    @like = Like.new(like_params)
    unless Like.where("user_id = #{@like.user_id}").where(["likeable_type LIKE ?", "%#{@like.likeable_type}%"]).where("likeable_id = #{@like.likeable_id}").exists?
      @like.state = true
      @like.save
      @object = @like.likeable_type.constantize.find(@like.likeable_id)
---
SELECT "likes".* FROM "likes" WHERE (user_id = 13) AND (likeable_type LIKE '%User%') AND (likeable_id = 1)
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
SELECT 1 AS one FROM "likes" WHERE (user_id = 13) AND (likeable_type LIKE '%User%') AND (likeable_id = 1) LIMIT $1  [["LIMIT", 1]]
INSERT INTO "likes" ("state", "user_id", "likeable_id", "likeable_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["state", true], ["user_id", 13], ["likeable_id", 1], ["likeable_type", "User"], ["created_at", "2020-09-25 15:13:22.516433"], ["updated_at", "2020-09-25 15:13:22.516433"]]

  def destroy
    @object = @like.likeable_type.constantize.find(@like.likeable_id)
    @object.votesCount -= 1
    @object.save
    @like.destroy
    render json: @object.as_json
    #redirect_to api_likes_path
  end

  private def like_params
    params.require(:like).permit(:state,:user_id,:likeable_id,:likeable_type)
  end

  private def find_like
    @like = Like.find(params[:id])
---
SELECT "likes".* FROM "likes" WHERE "likes"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 8]]
SELECT "likes".* FROM "likes" WHERE "likes"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]