app/controllers/api/users_controller.rb

  def index
    @user = User.includes([:comments,:cart])
    render json: @user.as_json(include: :likes) #[:comments, :cart])
---
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13)
SELECT "users".* FROM "users"